#include <stdio.h>

void swap (int *a, int *b) { //*a → стойността на x  *b → стойността на y
    //a = 5 b = 10
    int temporaryVariable; //👉 временна кутия
    temporaryVariable = *a; //temporary = a = 5
    *a = *b; //a = 10
    *b = temporaryVariable; // b = temp = a = 5 --> b = 5
}

int main() {
    int x, y;
    printf("Enter two numbers: ");
    scanf("%d %d", &x, &y);

    printf("Before slap: x = %d y = %d\n",x, y);

    swap(&x, &y);
    //&x → адресът на x (къде се намира в паметта)
    //&y → адресът на y (къде се намира в паметта)
    //👉 НЕ се подават числата, а местата им в паметта

    printf("After slap: x = %d y = %d",x, y);

    return 0;

}

//🧱 Как да го мислиш

// Представи си паметта като къщи:
// 🏠 x = къща, в която има число 5
// 📍 &x = адресът на къщата
// 🧭 p = табела, която сочи към адреса
// 🔓 *p = съдържанието на къщата
// 🔁 Два важни символа
//1. & → адрес       2. * → стойност на адреса
//👉 Pointer (указател) е променлива, която съхранява адрес в паметта,
//а не директно стойност.