#include <stdio.h>
int main() {
    int arr[5] = {1, 2, 3, 4, 5};
    //работиш с адреси
    printf("%p\n", arr);
    //👉 arr става указател към първия елемент == &arr[0]
    //👉 сочи към 0x100
    printf("%p\n", &arr);
    //👉 &arr адресът на целия масив
    //👉 пак започва от 0x100
    printf("%p\n", &arr[0]);
    //👉 &arr[0] директно адресът на първия елемент
    //👉 също 0x100
}

//🧠 Най-краткото обяснение:
//👉 всички сочат към началото
//👉 затова печатат еднакъв адрес
//👉 но типът им е различен → държат се различно при смятане

/* ПРИМЕР ЗА ЕКВИВАЛЕНТНОСТТА НА ИЗРАЗА arr[5] -> *(arr+5) -> 5[arr] */
//📌 arr[5] означава: 👉 6-тия елемент в масива
// *(arr + 5)
// 👉 вземи адреса на arr
// 👉 премести се с 5 елемента
// 👉 вземи стойността там
// *(5 + arr) == 5[arr]


