#include <stdio.h>

void myFunction(int *myVar) { //myVar е указател → държи адрес
    //myVar = адреса на x
    *myVar = 15; //*myVar означава: „стойността на адреса, към който сочи“
    //Понеже myVar сочи към x, това става:
    //x = 15;
}

int main () {
    int x = 5;
    printf("Before func: %d\n", x);
    myFunction(&x); //&x = „къде се намира x в паметта“
    //подаваш адреса на x (например нещо като 0x61ff08)
    printf("After func: %d\n", x);
}

//Това се нарича “подаване по адрес” (pass by reference)
//не даваш копие на стойността
//даваш достъп до самата променлива

//💡 Аналогия:
//x = кутия с число 5
//&x = адреса на кутията
//функцията получава адреса
//и отива директно до кутията и сменя съдържанието на 15